Repository: apertium/apertium-sme-sma
Catalog: tmx_data/vejolas_sme2sma.tmx
Source language: sme
Languages: sma

source: Lea vejolaš addit stipeandda sihke joatkkaskuvlla ohppiide, ja allaskuvlla ja universiteahta studeanttaide.
sma: Gåarede stipeendem vedtedh dovne jåarhkeskuvlen learoehkidie, jïh jïlleskuvlen jïh universiteeten studeentide. COMM:LEA VEJ. Ingenting er endret.

source: Sámegiela geavaheddjiidlogu lassáneapmi lea dan duohken ahte lea vejolaš geavahit sámegiela buot servodatsurggiin ja buot oktavuođain. COMM:LEA VEJ
sma: Saemiengïelen utnijilåhkoen læssanimmie båata destie mejtie gåarede gaajhkine siebriedahkensuerkine jïh gaajhkene lehkesne saemiengïelem nuhtjedh. COMM: Fjernet “ahte” og lagt til “mejtie” (er her usikker på om det skal stå det eller evt. “jis”) Oversatt “geavahit” til “nuhtjedh” og flyttet “nuhtjedh” rett etter objektet. Endret til “gaajhkine siebriedahkensuerkine” slik at det står i flt. som på nordsamisk. “gaajhkene siebredsuerkesne jïh gaajhkene lehkesne...” flyttet foran objekt og verb.

source: Konsultašuvnnat eai galgga loahpahuvvot nu guhká go Sámediggi ja stáhta oaivvildeaba ahte lea vejolaš olahit soahpamuša.
sma: Eah edtjh konsultasjovnh illesovvedh dan guhkiem goh Saemiedigkie jïh staate dennie mïelesne gåarede latjkoem jaksedh. COMM: Endret “staaten mielen mietie” til “dennie mielesne” (i den mening) fordi Saemiedigkie og staate “ikke er mennesker”. Endret “hinnedh” til “jaksedh”.

source: Ja danne ii leat ge vejolaš gávnnahit sámegielagiid logu dáinna vugiin.
sma: Jïh dannasinie ij gåaredh gih saemiestæjjaj låhkoem gaavnehtidh daejnie vuekine. COMM: Har tilføyd «gih» for nordsamisk «ge» rett etter verbet «gåaredh». Oversatt «gavnnahit» med «gaavnehtidh» og flyttet verbet rett etter objektet «låhkoem».

source: Sáhttá leat váttis joksat ulbmila ahte sámegiella galgá leat beaivválašgiella jus gielaid ii leat vejolaš geavahit árgabeaivvis.
sma: Maahta geerve ulmiem jaksedh, saemiengïele galka fïerhtenbeajjetje gïele, jis aarkebiejjien ij leah nuepie gïelide nuhtjedh. COMM: Har droppet «årrodh» som ofte er overflødig. Hvis «årrodh» må være med, så må det stå etter «geerve» (maahta geerve årrodh). Har fjernet «ahte» og satt inn komma. Har flyttet frem «aarkebiejjien» til rett etter «jis». Har benyttet meg av «nuepie» istedenfor «gåaredh» her. Har også satt «gielaid» i ack. Pl: «gïelide» ettersom «samegiella» er nevnt tidligere i setningen. Ettersom jeg fjerner "ahte" ville jeg egentlig formulert setningen slik: Maahta geerve ulmiem jaksedh, saemiengïele(m) fïerhtenbeajjetje gïeline, jis aarkebiejjien ij leah nuepie gïelide nuhtjedh.

source: Sámediggeráđi mielas goitge ii leat vejolaš álggahit nie stuorra prošeavtta ná oanehis áiggis.
sma: Saemiedigkieraerien mïelesne ij lïjhke gåaredh nimhtemes stoerre prosjeektem aelkiehtidh daan åenehks tïjjesne. COMM: Endret «mieleste» til iness. «mielesne», som brukes når noen mener noe. Flyttet «lïjhke» til etter negasjonen. Endret «naemhtie» til «nimhtemes» som er attr.form, og samsvarer mer med «nie». Men «dan» kan også brukes (men «dan» kanskje samsvarer mer med nords. «nu». Oversatt “ná” med «daan» (se Bergsland §67). Oversatt «oanehis aiggis» med iness. «åenehks tijjesne» og ikke i gen. Flyttet «aelkiehtidh» rett etter objektet.

source: Sámedikki bušeahta ráddjejuvvon ruhtadili geažil ii leat dássážii leamaš vejolaš juolludit eambbo go 5-600.000 ruvnno guđege giellaguovddážii
sma: Saemiedigkien beetnehsoejkesjen gaertjiedovveme ekonomijen dïete, ij leah daan raajan gåaradamme jeenjebem laeviehtidh goh 5-600.000 kråvnah fïereguhten gïelejarngese. COMM: Endret «gåaradidh» til «gåaradamme». Flyttet på «jeenjebem» foran verbet «laeviehtidh». (Usikker om dette skal gjøres om til en regel ennå). Fjernet «aaj» som sikkert har dukket opp i oversettelsen pga. «gudeGE».

source: Buohkaide geat máhttet sámegiela, lea stuora árvu beassat sámástit nu olu oktavuođain go vejolaš.
sma: Gaajhkesidie gïeh saemiengïelem maehtieh, stoerre aavoe åadtjodh saemiestidh dan gellene lehkesne goh gåarede. COMM: Endret “aarvoe” til “aavoe”. Oversatt “nu olu oktavuodain” med “dan gellene lehkesne”, også en mulighet: “gellene tsiehkesne”.

source: Jus galgá sihkkarastit giela boahtteáiggi, de lea dehálaš ahte nu oallugat go vejolaš ohppet giela sirdima bokte giellaguddiin.
sma: Jis gïelen båetije biejjieh edtja gorredidh, dle vihkele dan jïjnjesh goh gåarede gïeleguedtiejijstie gïelem lierieh sirtemen baakta. COMM: Har endret til «båetije biejjieh» som blir objektet. Endret fra akk. til gen. av «gïelen». Flytet «edtja» rett foran «gorredidh», men den kan selvfølgelig også stå rett etter «jis». Fjernet «ahte». Satt inn «sirtemen baakta» som en direkte oversettelse fra nordsamisk, men vet egentlig ikke hvor den passer inn her.

source: Namaid galget almmolaš eiseválddit dábálaččat geavahit kárttain oktan vejolaš dárogiel namain.
sma: Nommide edtjieh byjjes faamohkh jeenjemasth kaarhtine ektine utnedh, jis lea, dle daaroen nommine aaj. COMM: Endret til «nommide» i akk, men vanskelig å vite uten hele konteksten. Endret til «byjjes faamohkh» (ord som Anna Jacobsen brukte). «Åajvaladtjh» betyr mer myndighetspersoner. Oversatt «dabalaccat» med «jeenjemasth» (for det meste). Resten av setningen blir en omformulering, fordi sørsamisk ikke har noe bra oversettelse til «vejolas». Flyttet frem «ektine» til rett etter «kaarhtine», fordi det ellers virket som at ordet sto i essiv og ikke komitativ. Eventuelt lage en setning der vi bare fjerner «vejolas»: Nommide edtjieh byjjes faamohkh jeenjemasth kaarhtine ektine utnedh daaroen nommine.

source: Sámediggi áigu čađahit vejolaš konsultašuvnnaid minerálaealáhusstrategiija doaibmabijuid birra.
sma: Saemiedigkie edtja konsultasjovnh tjïrrehtidh mineraalejielemestrategijen råajvarimmiej bïjre. COMM: Fjernet «nuepies» oversettelse av «vejolas», fordi dette er et nylaget og fremmed ord, men dette må kanskje Anja godta etterhvert… Endret «konsultasjovni» til «konsultasjovnh» i nom. fordi det i teksten er ment som objekt. Flyttet verbet rett etter «konsultasjovnh».

source: Danne ferte Sámedikkis leat dakkár politihkka mainna deaivida daid hástalusaid maid vejolaš rievdadusat dagahit.
sma: Dannasinie tjuara Saemiedigkien dagkeres politihke mejnie dievvede dejtie haestiemidie mejtie jorkestimmieh maehtieh darjodh. COMM: Fjernet «årrodh» fordi det oftest er overflødig i slike sammenhenger hvor det på nordsamisk står: «ferte leat, galga leat, sahtta leat» osv. Oversatt «deaivida» til «dievvede». I denne sammenhenger passer det at «dievvede» står rett etter «mejnie» som på nordsamisk. Mulig at det har noe med plasseringen mellom to relativpronomener? Fjernet «nuepies» for «vejolas» og i stedet oversatt «dagahit» med «maehtieh darjodh».
